IDEA Open Model
OpenMessage.Create Method
Compatible with IDEA StatiCa 20.1
 Creating message
 Namespace: IdeaRS.OpenModel.Message
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public static OpenMessage Create(
	MessageNumber number,
	OpenObject openObject,
	string propertyName,
	string description,
	OpenMessage innerMessage = null
)
Public Shared Function Create (
	number As MessageNumber,
	openObject As OpenObject,
	propertyName As String,
	description As String,
	Optional innerMessage As OpenMessage = Nothing
) As OpenMessage
Parameters
number
Type: IdeaRS.OpenModel.Message.MessageNumber
Number of the message
openObject
Type: IdeaRS.OpenModel.OpenObject
Affected object
propertyName
Type: System.String
Affected property
description
Type: System.String
Description of the message
innerMessage (Optional)
Type: IdeaRS.OpenModel.Message.OpenMessage
Inner message
Return Value
Type: OpenMessage
The created message or null if the number is not supported
See Also
Reference
OpenMessage Class
IdeaRS.OpenModel.Message Namespace